teleger/GD32L235-Demo/Template/Keil_project/SHT4X-5.3/i2c_sw_implementation.c
#ifdef GD32L235
#include "gd32l23x.h"
#endif
#include "systick.h"
#include <stdio.h>
#include "main.h"
#include "gd32l23x_eval.h"


#define IIC_PORT     GPIOB
#define IIC_SDA_PIN  GPIO_PIN_8
#define IIC_SCL_PIN  GPIO_PIN_9

void IIC_Init(void)
{
    // GPIO_InitTypeDef GPIO_Initure;
    // __HAL_RCC_GPIOB_CLK_ENABLE();   //使能GPIOB时钟
    // //PH4,5初始化设置
    // GPIO_Initure.Pin=GPIO_PIN_6|GPIO_PIN_7;
    // GPIO_Initure.Mode=GPIO_MODE_OUTPUT_PP;  //推挽输出
    // GPIO_Initure.Pull=GPIO_PULLUP;          //上拉
    // GPIO_Initure.Speed=GPIO_SPEED_FREQ_HIGH;//高速
    // HAL_GPIO_Init(GPIOB,&GPIO_Initure);
    // IIC_SDA=1;
    // IIC_SCL=1;
    rcu_periph_clock_enable(RCU_GPIOB);
    /* configure GPIO pins of I2C0 */
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_8);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_8);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_9);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_9);  
    gpio_output_bit_set(GPIOB, GPIO_PIN_8);
    gpio_output_bit_set(GPIOB, GPIO_PIN_9);
}

//产生IIC起始信号
void IIC_Start(void)
{
	SDA_OUT();     //sda线输出
	gpio_output_bit_set(IIC_PORT, IIC_SDA_PIN);
    gpio_output_bit_set(IIC_PORT, IIC_SCL_PIN);
	delay_us(4);
 	gpio_output_bit_reset(IIC_PORT, IIC_SDA_PIN);//START:when CLK is high,DATA change form high to low 
	delay_us(4);
	gpio_output_bit_reset(IIC_PORT, IIC_SCL_PIN);//钳住I2C总线，准备发送或接收数据 
}	  
//产生IIC停止信号
void IIC_Stop(void)
{
	SDA_OUT();//sda线输出
	gpio_output_bit_reset(IIC_PORT, IIC_SCL_PIN);
	gpio_output_bit_reset(IIC_PORT, IIC_SDA_PIN);//STOP:when CLK is high DATA change form low to high
 	delay_us(4);
	gpio_output_bit_set(IIC_PORT, IIC_SCL_PIN); 
	gpio_output_bit_set(IIC_PORT, IIC_SDA_PIN);//发送I2C总线结束信号
	delay_us(4);							   	
}
//等待应答信号到来
//返回值：1，接收应答失败
//        0，接收应答成功
uint8_t IIC_Wait_Ack(void)
{
	uint8_t ucErrTime=0;
	SDA_IN();      //SDA设置为输入  
	gpio_output_bit_set(IIC_PORT, IIC_SDA_PIN);delay_us(1);	   
	gpio_output_bit_set(IIC_PORT, IIC_SCL_PIN);delay_us(1);	 
	while(READ_SDA)
	{
		ucErrTime++;
		if(ucErrTime>250)
		{
			IIC_Stop();
			return 1;
		}
	}
	gpio_output_bit_reset(IIC_PORT, IIC_SCL_PIN);//时钟输出0 	   
	return 0;  
} 
//产生ACK应答
void IIC_Ack(void)
{
	gpio_output_bit_reset(IIC_PORT, IIC_SCL_PIN);
	SDA_OUT();
	gpio_output_bit_reset(IIC_PORT, IIC_SDA_PIN);
	delay_us(2);
	gpio_output_bit_set(IIC_PORT, IIC_SCL_PIN);
	delay_us(2);
	gpio_output_bit_reset(IIC_PORT, IIC_SCL_PIN);
}
//不产生ACK应答		    
void IIC_NAck(void)
{
	gpio_output_bit_reset(IIC_PORT, IIC_SCL_PIN);
	SDA_OUT();
	gpio_output_bit_set(IIC_PORT, IIC_SDA_PIN);
	delay_us(2);
	gpio_output_bit_set(IIC_PORT, IIC_SCL_PIN);
	delay_us(2);
	gpio_output_bit_reset(IIC_PORT, IIC_SCL_PIN);
}
					 				     
//IIC发送一个字节
//返回从机有无应答
//1，有应答
//0，无应答			  
void IIC_Send_Byte(u8 txd)
{                        
    u8 t;   
	SDA_OUT(); 	    
    IIC_SCL=0;//拉低时钟开始数据传输
    for(t=0;t<8;t++)
    {              
        IIC_SDA=(txd&0x80)>>7;
        txd<<=1; 	  
		delay_us(2);   //对TEA5767这三个延时都是必须的
		IIC_SCL=1;
		delay_us(2); 
		IIC_SCL=0;	
		delay_us(2);
    }	 
} 	    
//读1个字节，ack=1时，发送ACK，ack=0，发送nACK   
u8 IIC_Read_Byte(unsigned char ack)
{
	unsigned char i,receive=0;
	SDA_IN();//SDA设置为输入
    for(i=0;i<8;i++ )
	{
        IIC_SCL=0; 
        delay_us(2);
		IIC_SCL=1;
        receive<<=1;
        if(READ_SDA)receive++;   
		delay_us(1); 
    }					 
    if (!ack)
        IIC_NAck();//发送nACK
    else
        IIC_Ack(); //发送ACK   
    return receive;
}


void IIC_Delay(){
    unsigned char x;
    for(x=1;x>0;x--){
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
    }
}